martinbaillie.org
#+seq_todo: TODO DRAFT DONE
#+property: header-args :eval never-export
#+startup: indent
#+author: Martin Baillie
#+hugo_base_dir: ./

* DONE ID
CLOSED: [2020-01-03 Fri 21:44]
:PROPERTIES:
:EXPORT_HUGO_SECTION: id
:EXPORT_FILE_NAME: _index
:EXPORT_HUGO_LAYOUT: single
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :tldr Sort of like my LinkedIn profile but with sentences.
:END:
** Locale
Growing up on the west coast of Scotland and only having English as a
language (barely, some have noted), I sampled parts of the USA after graduating
before settling in Australia where I have stayed since 2009 (Sydney 2014—).
** Master of none
Professionally I am fond of the saying /"Jack of all trades, master of none"/. I
suppose I feel it either reflects my staunch attempts to stay relevant as an
individual contributor or my pursuit of being ever more "M" shaped in my
discipline (literally speaking however, I am very much beanpole shaped). As a
compound sentence, though, I prefer the second clause because its connotation is
less presumptuous about me knowing the answer to something.

Career-wise I am a (recovering) enterprise Java person of many years currently
enjoying a prolonged excursion in the still nascent field of platform
engineering.

*** Platform Engineering
As it has transpired, the upshot of spending my earlier career with a CRM
consultancy spruiking some fairly esoteric tech is that I have always built and
run my own stuff. Constructing production stacks on client sites from scratch
and subsequently owning the code deployed to them has always been a thing for
me; dedicated Ops teams a foreign concept.

I started as a product engineer but soon shifted to being across multiple teams
in a technical capacity either as a floating tech lead or architect (this title
having been prefixed with "solutions", "systems", and "software" depending on
the gig).

Around 2015 and on the back of what I jokingly refer to as the /great Australian
"DevOps enterprise transformation movement"/, I had the opportunity to lead
different kind of team. We were tasked with building out a self-servicable
hybrid cloud platform for other product engineers to consume—billed as an
internal Heroku at the time. ThoughtWorks would later call these teams [[https://www.thoughtworks.com/radar/techniques/platform-engineering-product-teams][platform
product engineering teams]] which I think is apt because if you are not treating
these things like internal products you +will+ may have a bad time.

Anyway, my last two contracts have been at the helm of such teams building these
internal platforms from the ground up. Both times the task has been to enable
modern ([[https://en.wikipedia.org/wiki/Microservices][micro]]-)SOAs atop secure and reliable cloud platform foundations that
have been tailored for easy self-service, continuous delivery and runtime
observability. The goal is always enabling product engineers to have acute focus
on business logic by having the platform handle as many non-differentiating,
cross-cutting concerns as is technically feasible.

So this is the sort of role I find myself in for the time being and there are
lots of organisations that need the help in this space. Nevertheless, at some
point I would like to return to true full-stack product engineering roles where
my customers are the organisation's customers.

** Contact
It might be helpful at this juncture to know that I do actually maintain the
industry-requisite [[https://linkedin.com/in/martinbaillie][LinkedIn]] profile and keep the dot points somewhat aligned to
my movements.

Otherwise, I am also on [[https://keybase.io/martinbaillie][Twitter/Mastodon]] but, fair warning, predominately as a
consumer and re-tweet/toot-er. If you are expecting smoking hot takes on why I
think your microservices are the wrong size or why you need Kubernetes and Istio
you will probably be disappointed. With that said, I do enjoy shooting the
breeze about tech and my DMs are open, as they say. I can be reached by other
means too (see: footer).
** This Site
The main purpose of this site is to surface what I have opted to call
/[[/wrote/fieldnotes][Fieldnotes]]/.

Because I switch my own system themes depending on the time of day, this site
likewise has a dark and light theme. It is automatically chosen based on your
system preference but you can override with the wee icon at the top right.

Notwithstanding the slightly brutalist design, I'll strive to keep this site
otherwise as accessible as possible, and respecting of your privacy. If you
think I am dropping the ball on this please let me know.
